class HomePageFaq:
    answer1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    answer2 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    answer3 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    answer4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    answer5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    answer6 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    answer7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    answer8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

class TestData:
    data_sets = {
        'data_set1': {
            'name': 'Александра',
            'surname': 'Новогодняя',
            'address': 'улица Спортивная',
            'metro_station': 'Сокольники',
            'phone_number': '791234567890',
            'date': '01.01.2025',
            'rental_period': 0,
            'color': [0],
            'comment_for_courier' : 'Оставить у двери'
        },
        'data_set2': {
            'name': 'Валерия',
            'surname': 'Морозова',
            'address': 'улица Дудина',
            'metro_station': 'Багратионовская',
            'phone_number': '70987654321',
            'date': '02.01.2025',
            'rental_period': 0,
            'color': [1],
            'comment_for_courier' : 'Не звоните в домофон'
        }
    }